RepoBiteCoFinal/biteco_fixed/Seguridad/Test/plan_prueba_experimento.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  Plan de Prueba JMeter - Experimento Latencia Microservicios
  ==============================================================
  ASR: Latencia < 100ms en generación de reportes financieros
  
  Cómo importar:
    1. Abrir JMeter (Apache JMeter 5.x o superior)
    2. File → Open → seleccionar este archivo .jmx
    3. Ajustar las IPs de EC2 en los HTTP Request Samplers
    4. Run → Start
  
  Cómo correr en CLI (headless en EC2):
    jmeter -n -t plan_prueba_experimento.jmx -l resultados.jtl -e -o reporte_html/
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Experimento Latencia Microservicios Bite.Co" enabled="true">
      <stringProp name="TestPlan.comments">
        Prueba A: Secuencial (sin broker) vs Prueba B: Con Broker/Microservicios
        ASR: Latencia máxima 100ms por consulta de reporte
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables Globales" enabled="true">
        <collectionProp name="Arguments.arguments">
          <!-- ⚙️ AJUSTAR ESTAS IPs ANTES DE CORRER -->
          <elementProp name="HOST_ORQUESTADOR" elementType="Argument">
            <stringProp name="Argument.name">HOST_ORQUESTADOR</stringProp>
            <stringProp name="Argument.value">54.123.45.67</stringProp>  <!-- IP EC2 Orquestador -->
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PUERTO_ORQUESTADOR" elementType="Argument">
            <stringProp name="Argument.name">PUERTO_ORQUESTADOR</stringProp>
            <stringProp name="Argument.value">8002</stringProp>
          </elementProp>
          <elementProp name="PROJECT_ID" elementType="Argument">
            <stringProp name="Argument.name">PROJECT_ID</stringProp>
            <stringProp name="Argument.value">proyecto-experimento</stringProp>
          </elementProp>
          <elementProp name="MES" elementType="Argument">
            <stringProp name="Argument.name">MES</stringProp>
            <stringProp name="Argument.value">2024-11</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ══════════════════════════════════════════════════════ -->
      <!-- PRUEBA A: MODO SECUENCIAL                             -->
      <!-- ══════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Prueba A - Secuencial (sin Broker)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <!-- Subir de 1 a 500 usuarios en 5 minutos (ramp-up) -->
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Samplers de carga: 1, 10, 50, 100, 200, 500 usuarios -->
        <!-- JMeter escalará automáticamente con el ramp-up -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Reporte Secuencial" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST_ORQUESTADOR}</stringProp>
          <stringProp name="HTTPSampler.port">${PUERTO_ORQUESTADOR}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/reportes/${PROJECT_ID}/${MES}/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Assertion: Verificar que el status es 200 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Verificar HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">El endpoint debe retornar HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Assertion: Latencia < 100ms (ASR) -->
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="ASR: Latencia &lt; 100ms" enabled="true">
            <longProp name="DurationAssertion.duration">100</longProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <!-- Listeners de resultados -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report - Secuencial" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">resultados_secuencial.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Response Time Graph - Secuencial" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">resultados_secuencial.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ══════════════════════════════════════════════════════ -->
      <!-- PRUEBA B: MODO CON BROKER / MICROSERVICIOS            -->
      <!-- ══════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Prueba B - Con Broker (Microservicios)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Reporte Con Broker" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST_ORQUESTADOR}</stringProp>
          <stringProp name="HTTPSampler.port">${PUERTO_ORQUESTADOR}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <!-- 
            ⚙️ CAMBIAR esta URL al endpoint del orquestador CON BROKER
            cuando esté implementado el modo paralelo.
            Ejemplo: /api/reportes-broker/${PROJECT_ID}/${MES}/
          -->
          <stringProp name="HTTPSampler.path">/api/reportes/${PROJECT_ID}/${MES}/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Verificar HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="ASR: Latencia &lt; 100ms" enabled="true">
            <longProp name="DurationAssertion.duration">100</longProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report - Con Broker" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">resultados_broker.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>